{"modelTopology": {"training_config": {"metrics": ["accuracy"], "loss": "categorical_crossentropy", "optimizer_config": {"class_name": "Adam", "config": {"beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "decay": 0.0, "epsilon": 1e-07, "amsgrad": false, "lr": 0.0010000000474974513}}, "sample_weight_mode": null, "loss_weights": null}, "keras_version": "2.1.6-tf", "model_config": {"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"dtype": "float32", "batch_input_shape": [null, 100, 100, 3], "name": "input_13", "sparse": false}, "name": "input_13"}, {"class_name": "Conv2D", "inbound_nodes": [[["input_13", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_58", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 16, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "batch_input_shape": [null, 100, 100, 3], "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv2d_58"}, {"class_name": "Conv2D", "inbound_nodes": [[["conv2d_58", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_59", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 16, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv2d_59"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_59", 0, 0, {}]]], "config": {"name": "max_pooling2d_30", "dtype": "float32", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2]}, "name": "max_pooling2d_30"}, {"class_name": "Dropout", "inbound_nodes": [[["max_pooling2d_30", 0, 0, {}]]], "config": {"name": "dropout_61", "dtype": "float32", "trainable": true, "rate": 0.25, "seed": null, "noise_shape": null}, "name": "dropout_61"}, {"class_name": "Conv2D", "inbound_nodes": [[["dropout_61", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_60", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv2d_60"}, {"class_name": "Conv2D", "inbound_nodes": [[["conv2d_60", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_61", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv2d_61"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_61", 0, 0, {}]]], "config": {"name": "max_pooling2d_31", "dtype": "float32", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2]}, "name": "max_pooling2d_31"}, {"class_name": "InputLayer", "inbound_nodes": [], "config": {"dtype": "float32", "batch_input_shape": [null, 2], "name": "input_14", "sparse": false}, "name": "input_14"}, {"class_name": "Dropout", "inbound_nodes": [[["max_pooling2d_31", 0, 0, {}]]], "config": {"name": "dropout_62", "dtype": "float32", "trainable": true, "rate": 0.25, "seed": null, "noise_shape": null}, "name": "dropout_62"}, {"class_name": "Dense", "inbound_nodes": [[["input_14", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_38", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "units": 12, "batch_input_shape": [null, 2], "use_bias": true, "activity_regularizer": null}, "name": "dense_38"}, {"class_name": "Flatten", "inbound_nodes": [[["dropout_62", 0, 0, {}]]], "config": {"dtype": "float32", "trainable": true, "name": "flatten_14", "data_format": "channels_last"}, "name": "flatten_14"}, {"class_name": "Dropout", "inbound_nodes": [[["dense_38", 0, 0, {}]]], "config": {"name": "dropout_64", "dtype": "float32", "trainable": true, "rate": 0.2, "seed": null, "noise_shape": null}, "name": "dropout_64"}, {"class_name": "Dense", "inbound_nodes": [[["flatten_14", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_37", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "units": 256, "use_bias": true, "activity_regularizer": null}, "name": "dense_37"}, {"class_name": "Dense", "inbound_nodes": [[["dropout_64", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_39", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "units": 6, "use_bias": true, "activity_regularizer": null}, "name": "dense_39"}, {"class_name": "Dropout", "inbound_nodes": [[["dense_37", 0, 0, {}]]], "config": {"name": "dropout_63", "dtype": "float32", "trainable": true, "rate": 0.5, "seed": null, "noise_shape": null}, "name": "dropout_63"}, {"class_name": "Dropout", "inbound_nodes": [[["dense_39", 0, 0, {}]]], "config": {"name": "dropout_65", "dtype": "float32", "trainable": true, "rate": 0.2, "seed": null, "noise_shape": null}, "name": "dropout_65"}, {"class_name": "Concatenate", "inbound_nodes": [[["dropout_63", 0, 0, {}], ["dropout_65", 0, 0, {}]]], "config": {"dtype": "float32", "trainable": true, "name": "concatenate_3", "axis": -1}, "name": "concatenate_3"}, {"class_name": "Dense", "inbound_nodes": [[["concatenate_3", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_40", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "softmax", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "units": 11, "use_bias": true, "activity_regularizer": null}, "name": "dense_40"}], "input_layers": [["input_13", 0, 0], ["input_14", 0, 0]], "name": "model_9", "output_layers": [["dense_40", 0, 0]]}}, "backend": "tensorflow"}, "weightsManifest": [{"paths": ["../dvr8qkta1ir5qit/group1-shard1of2", "../bszyer13ewhiiay/group1-shard2of2"], "weights": [{"dtype": "float32", "shape": [3, 3, 3, 16], "name": "conv2d_58/kernel", "quantization": {"dtype": "uint8", "scale": 0.0039228282722772335, "min": -0.419742625133664}}, {"dtype": "float32", "shape": [16], "name": "conv2d_58/bias", "quantization": {"dtype": "uint8", "scale": 0.0023487070027519673, "min": -0.34291122240178723}}, {"dtype": "float32", "shape": [3, 3, 16, 16], "name": "conv2d_59/kernel", "quantization": {"dtype": "uint8", "scale": 0.005128287217196296, "min": -0.8820654013577629}}, {"dtype": "float32", "shape": [16], "name": "conv2d_59/bias", "quantization": {"dtype": "uint8", "scale": 0.0013596851451724184, "min": -0.13596851451724185}}, {"dtype": "float32", "shape": [3, 3, 16, 32], "name": "conv2d_60/kernel", "quantization": {"dtype": "uint8", "scale": 0.008337974080852434, "min": -1.517511282715143}}, {"dtype": "float32", "shape": [32], "name": "conv2d_60/bias", "quantization": {"dtype": "uint8", "scale": 0.0014523320046125675, "min": -0.28756173691328835}}, {"dtype": "float32", "shape": [3, 3, 32, 32], "name": "conv2d_61/kernel", "quantization": {"dtype": "uint8", "scale": 0.005789777344348384, "min": -0.8916257110296512}}, {"dtype": "float32", "shape": [32], "name": "conv2d_61/bias", "quantization": {"dtype": "uint8", "scale": 0.001235010204654114, "min": -0.2877573776844085}}, {"dtype": "float32", "shape": [20000, 256], "name": "dense_37/kernel", "quantization": {"dtype": "uint8", "scale": 0.007025361762327306, "min": -0.9132970291025498}}, {"dtype": "float32", "shape": [256], "name": "dense_37/bias", "quantization": {"dtype": "uint8", "scale": 0.0027889144186880074, "min": -0.4155482483845131}}, {"dtype": "float32", "shape": [2, 12], "name": "dense_38/kernel", "quantization": {"dtype": "uint8", "scale": 0.010228963926726696, "min": -0.9308357173321293}}, {"dtype": "float32", "shape": [12], "name": "dense_38/bias", "quantization": {"dtype": "uint8", "scale": 0.009792535445269417, "min": -1.9291294827180752}}, {"dtype": "float32", "shape": [12, 6], "name": "dense_39/kernel", "quantization": {"dtype": "uint8", "scale": 0.020006649166929954, "min": -2.140711460861505}}, {"dtype": "float32", "shape": [6], "name": "dense_39/bias", "quantization": {"dtype": "uint8", "scale": 0.002871763180283939, "min": -0.21825400170157938}}, {"dtype": "float32", "shape": [262, 11], "name": "dense_40/kernel", "quantization": {"dtype": "uint8", "scale": 0.023810875415802003, "min": -5.619366598129273}}, {"dtype": "float32", "shape": [11], "name": "dense_40/bias", "quantization": {"dtype": "uint8", "scale": 0.007755348495408601, "min": -1.0159506528985267}}]}]}
